app/views/top/index.html.erb

        <div class="cardWrapper">
          <% list.cards.each do |card| %>
---
SELECT "cards".* FROM "cards" WHERE "cards"."list_id" = ?  [["list_id", 2]]